<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest Mbed Studio pkg</string>
	<key>Identifier</key>
	<string>com.github.d33t5.pkg.MbedStudio</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.d33t5.download.MbedStudio</string>
	<key>Process</key>
       <array>
          <dict>
             <key>Arguments</key>
             <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
             </dict>
             <key>Processor</key>
             <string>FlatPkgUnpacker</string>
          </dict>
          <dict>
             <key>Arguments</key>
             <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack/*.pkg</string>
             </dict>
             <key>Processor</key>
             <string>FileFinder</string>
          </dict>
          <dict>
             <key>Arguments</key>
             <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
             </dict>
             <key>Processor</key>
             <string>PkgPayloadUnpacker</string>
          </dict>
          <dict>
             <key>Arguments</key>
             <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload/Mbed Studio.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
             </dict>
             <key>Processor</key>
             <string>Versioner</string>
          </dict>
          <dict>
             <key>Processor</key>
             <string>PkgCopier</string>
             <key>Arguments</key>
             <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/MbedStudio-%version%.pkg</string>
             </dict>
          </dict>
          <dict>
             <key>Processor</key>
             <string>PathDeleter</string>
             <key>Arguments</key>
             <dict>
                <key>path_list</key>
                <array>
                   <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                   <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                </array>
             </dict>
          </dict>
       </array>
    </dict>
 </plist>
